Revit 2027 API
BuiltInFailures.StairRampFailures.CannotPlaceRailingOnStringerWarning Property
 Railing is placed on tread because there is no stringer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceRailingOnStringerWarning { get; }
Public Shared ReadOnly Property CannotPlaceRailingOnStringerWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceRailingOnStringerWarning {
	FailureDefinitionId^ get ();
}
static member CannotPlaceRailingOnStringerWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace